In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [3]:
float_data.isna() #Not Available

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data = pd.Series(["a", np.nan, None, "d"])
string_data
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [5]:
float_data = pd.Series([1, 2, None], dtype='float64')
float_data
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [6]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna() #drop not available: nan 값 지우는 것

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
pd.DataFrame(data)

     0
0  1.0
1  NaN
2  3.5
3  NaN
4  7.0

In [8]:
data.notna()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [9]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data
data.dropna()

#행 값들 중 하나라도 비면 drop

     0    1    2
0  1.0  6.5  3.0

In [11]:
data.dropna(how="all") # 전부다 비어야 drop 한다.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data[4] = np.nan
data
#data.dropna(axis="columns", how="all")
data.dropna(axis="columns")

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [13]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df

          0         1         2
0  1.184211 -1.146024 -0.123338
1  0.546024 -0.330838  1.209197
2  1.549762  0.283253 -1.231397
3  1.004344 -0.844374  0.109790
4  0.903598  0.602399 -0.233321
5  0.927881 -0.078748 -1.104545
6 -0.921467 -0.559308  0.074805

In [14]:
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  1.184211       NaN       NaN
1  0.546024       NaN       NaN
2  1.549762       NaN -1.231397
3  1.004344       NaN  0.109790
4  0.903598  0.602399 -0.233321
5  0.927881 -0.078748 -1.104545
6 -0.921467 -0.559308  0.074805

In [15]:
df_d=df.dropna(thresh=2)
df_d

          0         1         2
2  1.549762       NaN -1.231397
3  1.004344       NaN  0.109790
4  0.903598  0.602399 -0.233321
5  0.927881 -0.078748 -1.104545
6 -0.921467 -0.559308  0.074805

In [16]:
df_f=df.fillna(0)
df_f

          0         1         2
0  1.184211  0.000000  0.000000
1  0.546024  0.000000  0.000000
2  1.549762  0.000000 -1.231397
3  1.004344  0.000000  0.109790
4  0.903598  0.602399 -0.233321
5  0.927881 -0.078748 -1.104545
6 -0.921467 -0.559308  0.074805

In [17]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  1.184211  0.500000  0.000000
1  0.546024  0.500000  0.000000
2  1.549762  0.500000 -1.231397
3  1.004344  0.500000  0.109790
4  0.903598  0.602399 -0.233321
5  0.927881 -0.078748 -1.104545
6 -0.921467 -0.559308  0.074805

In [18]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0 -0.384796 -0.964631  0.784723
1 -0.555471  1.592917 -1.486280
2 -1.117355       NaN  0.476325
3 -0.870746       NaN  0.716416
4  0.183322       NaN       NaN
5 -0.001607       NaN       NaN

In [19]:
df.fillna(method="ffill")
df_fill=df.fillna(method="ffill", limit=2)
df_fill

          0         1         2
0 -0.384796 -0.964631  0.784723
1 -0.555471  1.592917 -1.486280
2 -1.117355  1.592917  0.476325
3 -0.870746  1.592917  0.716416
4  0.183322       NaN  0.716416
5 -0.001607       NaN  0.716416

In [20]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [21]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [22]:
data.duplicated() #인덱스 중복이면 True 중복아니면 False

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [23]:
df_drop=data.drop_duplicates()
pd.DataFrame(df_drop)

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [24]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [25]:
data["v1"] = range(7)
data
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [26]:
data.drop_duplicates(["k1", "k2"], keep="last") #둘 다 중복 일 경우만 drop

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [27]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [28]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [29]:
data["animal"] = data["food"].map(meat_to_animal) #food와 대응되는 값을 map해서 animal이라는 컬럼으로 추가
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [30]:
def get_animal(x):
    return meat_to_animal[x]
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [31]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [32]:
data.replace(-999, np.nan) ## 특정한 값을 지정한 값으로 대체

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [33]:
data.replace([-999, -1000], np.nan) #두개도 가능

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [34]:
data.replace([-999, -1000], [np.nan, 0]) #대응되는 값으로도 가능 -999 는 nan으로 -1000 은 0 으로 대체

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [35]:
data.replace({-999: np.nan, -1000: 0}) #위와 같은 방법

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [36]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])

In [37]:
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [38]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [39]:
data.rename(index=str.title, columns=str.upper) #이름 갱신

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [40]:
data.rename(index={"OHIO": "INDIANA"}, #이름 수정
            columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [41]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32] #cut을 통해 범주화 할 대상
bins = [18, 25, 35, 60, 100]                            #범주화의 기준 [18,25) --> ages가 이 범위면 age_categories에 들어감 
labels=['a','b','c','d']                                #label을 정하면 그 라벨이 age_categories에 들어감 
age_categories = pd.cut(ages, bins,labels=labels)                     
age_categories[:10]

['a', 'a', 'a', 'b', 'a', 'a', 'c', 'b', 'd', 'c']
Categories (4, object): ['a' < 'b' < 'c' < 'd']

In [42]:
print(age_categories.codes)
print(age_categories.categories)
print(age_categories.categories[0])
pd.value_counts(age_categories)

[0 0 0 1 0 0 2 1 3 2 2 1]
Index(['a', 'b', 'c', 'd'], dtype='object')
a

a    5
b    3
c    3
d    1
dtype: int64

In [43]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [44]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [45]:
data = np.random.uniform(size=20)
pd.cut(data, 4, precision=2)

[(0.28, 0.49], (0.71, 0.92], (0.71, 0.92], (0.71, 0.92], (0.28, 0.49], ..., (0.28, 0.49], (0.49, 0.71], (0.71, 0.92], (0.71, 0.92], (0.065, 0.28]]
Length: 20
Categories (4, interval[float64, right]): [(0.065, 0.28] < (0.28, 0.49] < (0.49, 0.71] < (0.71, 0.92]]

In [46]:
data = np.random.standard_normal(1000)
data

array([ 4.48815856e-01, -3.52548646e-02, -1.22863499e+00,  8.91585952e-01,
        5.60354483e-01,  9.83834036e-01,  5.64784933e-03, -1.30230009e+00,
        4.86959074e-01, -7.24184342e-01,  2.55508605e+00,  3.29398024e-01,
       -1.40124792e+00,  1.77475798e-01, -1.02091289e+00,  2.89567218e-01,
        5.37063500e-01, -1.12101462e+00,  3.46779751e-01, -3.90942307e-01,
       -7.73580915e-01,  9.63722378e-01, -5.86932702e-01,  5.79417596e-01,
        2.40012380e-01,  6.67487836e-01,  1.10841130e+00, -1.56544837e-01,
       -1.22048006e+00,  5.49356400e-01,  7.88331534e-01, -9.43089520e-01,
       -7.40500332e-01, -1.90172947e-01,  7.31044374e-01, -1.86469031e-01,
       -1.05549755e+00, -6.07993966e-01,  1.54496978e+00,  1.66000647e+00,
       -7.62496285e-01, -6.89080666e-01,  1.41193672e+00, -9.14369048e-01,
        9.06693224e-01,  8.47546629e-01, -2.92718608e-02, -8.28422437e-01,
        1.13825450e+00,  1.41227096e-01,  1.56983330e-01, -2.48205522e+00,
        3.19192513e-01,  9.33375408e-01, -1.27858342e-01,  2.96937594e-01,
       -2.55254369e+00, -7.39134949e-01, -2.87342234e-01, -1.94611713e+00,
        9.16630053e-01,  1.37917440e+00, -7.88817524e-01,  4.68208914e-01,
       -4.43454108e-01, -1.70423130e-01,  4.77803033e-01,  1.76871886e-01,
        5.69531197e-01,  4.66586163e-01,  1.57642341e-01, -6.69628767e-01,
        1.02512903e+00, -8.31540692e-01,  1.25941747e+00, -1.05179160e+00,
       -7.62654752e-01, -1.21740511e+00,  1.43137882e-01,  5.33132121e-01,
       -4.41374722e-01,  8.42888738e-01,  4.67100846e-01, -1.69091581e+00,
       -6.18333634e-01,  1.01819107e-01,  2.66917072e-01, -7.28693361e-01,
        5.71574138e-01, -7.63981159e-01,  2.83625334e+00,  5.58328189e-01,
       -1.42382565e-01, -4.98257476e-01, -1.91492519e+00,  2.16840132e+00,
        1.38128445e+00,  4.62832480e-01,  1.18308301e+00,  4.52581671e-01,
        2.18117503e-01, -1.29014225e+00,  6.98384460e-01, -4.66524647e-01,
       -1.07302901e+00, -2.12536686e-01,  3.28258693e-01, -6.10386570e-02,
       -2.20886108e+00, -7.21072553e-01,  2.94972612e-01,  6.02971794e-01,
        2.45605530e-01, -8.80838141e-01,  8.69379845e-01, -2.46009714e-01,
       -6.51850401e-01,  9.93090841e-01,  1.41345629e+00,  5.67765728e-02,
       -1.44043832e+00,  1.87002451e+00,  2.43564032e-03,  8.34193751e-01,
       -1.18728246e+00,  9.67169990e-01, -6.92126272e-02, -5.51382318e-01,
        2.08962233e-01,  4.69242032e-01,  2.01317986e+00, -3.80848008e-01,
        9.68452952e-01,  2.57812298e-01,  1.17484961e+00,  8.56704719e-01,
       -2.16565205e+00, -6.05759448e-01, -1.95742638e-01, -1.00811909e+00,
       -1.78902064e+00, -1.19247220e+00, -4.38998645e-02, -2.12769263e+00,
       -1.02397314e+00,  4.33608628e-01, -1.01662239e-01, -1.26638647e+00,
       -1.88252407e-01,  5.85391383e-01, -4.33343128e-01,  4.13598424e-01,
        1.00777262e+00, -8.76735638e-02,  1.87876351e+00, -1.14678966e+00,
       -9.14695393e-01,  6.65638583e-01,  1.11131637e+00,  8.98363683e-01,
       -7.56129584e-01,  1.38611296e+00,  1.08928843e+00, -2.61443311e-01,
        6.71003924e-01, -5.21882879e-01, -6.95637708e-01, -1.65332709e+00,
       -1.18761984e+00, -3.03589317e-01, -7.73233808e-02,  1.54272530e+00,
        7.82560154e-01,  9.54426964e-01,  3.63621763e-01, -3.56166332e-01,
        1.02637863e+00,  8.00843762e-01, -2.41568198e-01,  4.10255878e-01,
        8.40002937e-01, -7.33365007e-01, -3.17913407e-01, -1.23692143e-01,
        5.75188932e-01,  2.00464869e-01,  3.91022497e-02, -1.67523875e+00,
       -4.00714084e-01, -2.86874607e-01,  1.47230576e-01,  3.46075704e-01,
        3.02026725e-03, -4.11265093e-01, -4.71464590e-01,  1.00908017e+00,
        3.63222401e-01,  1.09656284e+00,  2.32831942e-01, -1.09620020e+00,
        7.69989185e-01, -4.26202760e-01, -2.14021629e+00, -1.97408079e-02,
       -1.19709227e+00, -1.92855380e+00,  2.45129615e-01, -6.40279831e-01,
       -4.31546202e-01,  1.30467347e+00, -5.18142284e-01, -1.24983239e+00,
       -2.52490579e-01,  4.57644915e-01,  4.74083124e-01,  1.53519997e-01,
       -2.34870033e+00,  9.85946121e-01,  2.93026480e-01,  5.03503389e-01,
       -4.09167564e-01,  2.11924388e-01, -3.23427556e-02,  9.73756989e-02,
       -3.17722864e-01, -1.64999039e+00,  7.99161593e-01,  1.76194104e+00,
       -6.55170294e-01, -2.67994318e-01, -2.29993930e+00,  3.61281650e-01,
       -8.55988470e-01, -3.49186300e-01,  1.38410904e-01,  2.74131406e-01,
       -3.16261132e+00,  1.78705055e+00,  1.98464593e-01,  3.92381862e-01,
        6.79091178e-01, -2.35941791e-01, -8.29617219e-01, -5.57620689e-01,
       -1.18586709e+00,  5.94767108e-01,  4.71954361e-02,  1.01889173e+00,
       -5.72777106e-01,  3.37053539e-01,  3.85639884e-01, -1.99774313e-01,
       -1.46400266e-01, -2.30065706e-01, -5.91046455e-01,  1.04697445e+00,
       -1.78061806e+00, -3.30768756e-01, -3.45426504e-01,  1.20196811e+00,
       -5.61694837e-01,  9.37349672e-01,  1.54503674e+00, -1.07417980e+00,
        1.42345833e+00,  6.91807709e-01, -3.05250102e-01, -7.18310676e-03,
       -7.57171700e-01,  4.31018207e-01,  2.74963496e-01, -3.69068553e-01,
        2.53113491e+00, -4.21585023e-01, -9.97984200e-01,  6.73820127e-01,
       -1.81961125e-01,  1.04075221e+00,  1.24908027e+00,  1.09851184e+00,
        4.47831209e-01, -5.99719090e-01,  1.10263096e-01,  3.82016688e-01,
        2.06579877e-01,  6.22365173e-01, -6.99152912e-01, -5.21330825e-01,
       -4.54189951e-02, -1.33867572e+00, -1.79566368e-01,  9.52978793e-01,
       -1.32615494e+00, -1.01463806e+00,  3.12513807e-01, -2.67885075e+00,
        6.80944377e-01, -1.79956540e+00, -1.17622495e-01,  1.78912075e-01,
       -1.49676828e-01,  3.21522259e-01, -7.18075397e-01,  2.34486102e+00,
       -3.57382057e-01,  2.15758833e-01,  3.25609602e-01,  9.82404402e-01,
       -2.56733317e-01,  1.31603214e+00,  8.34857493e-01, -7.29976390e-01,
       -3.91278074e-01,  5.31104189e-01,  6.95015169e-01, -9.85635610e-01,
       -9.21708976e-01, -8.40565247e-01,  8.52187373e-01, -1.01979041e-01,
        8.04590138e-02, -1.14333444e+00,  1.43463705e+00,  1.82074039e+00,
       -1.81591295e+00, -3.69492616e-01,  5.44826743e-01, -4.95243742e-04,
       -7.76156800e-01, -2.49306769e+00,  2.45799460e-01,  2.96048423e-01,
       -1.54915837e+00,  6.49337477e-01,  1.03134575e+00, -6.82031381e-01,
       -5.24974896e-01, -1.24080600e-01, -3.86095437e-01, -4.60789323e-01,
        3.10963252e-01,  1.52987338e+00, -5.94861700e-03, -2.59127061e-01,
        4.09946375e-01, -7.56796774e-01,  5.42590849e-01, -6.07152803e-01,
        1.37776105e+00, -6.18585478e-01,  1.88930493e-01, -9.64739448e-03,
        1.15240523e+00,  1.80885723e+00,  1.53138374e+00, -2.53605300e-01,
        1.31903834e+00, -1.08366241e+00,  3.38737063e-01,  9.87533634e-01,
       -7.35523539e-01,  6.62324503e-01, -4.56277446e-01, -7.99084605e-01,
        7.71939059e-01, -5.02404224e-01,  1.56220010e+00, -9.36154563e-02,
       -2.42532530e-01, -2.63865815e-01,  1.31165883e+00,  1.33192991e+00,
       -4.65903522e-01, -5.28544254e-01, -8.28712091e-01,  6.43420072e-01,
       -1.03145553e+00, -1.50542668e+00, -1.06475951e+00,  2.19643488e-01,
        5.33836306e-01,  9.35133245e-01,  2.44342791e+00,  7.02605874e-01,
        1.02425958e+00, -7.98265252e-01, -1.18053330e+00,  8.74593599e-01,
       -9.30713184e-01,  2.14548455e+00, -9.54187889e-01,  4.15739675e-01,
       -3.90995335e-01,  5.65790094e-01,  9.18122755e-01, -9.84280838e-01,
       -2.18338682e-01,  1.02098992e+00,  1.20464245e-03, -1.66421502e+00,
       -7.09652693e-01,  1.77141460e+00,  2.03478123e+00,  3.19746170e-01,
       -3.50678362e-01, -2.05508244e+00,  1.89320640e+00, -3.45858566e-01,
       -4.69196974e-01,  3.58804368e-02, -9.74246762e-01, -1.00874839e+00,
       -1.01491640e+00,  3.27928985e-01, -4.64367493e-02, -4.96602944e-01,
        3.47698658e-01,  2.77405298e-01,  8.00244106e-01, -8.90033763e-01,
       -1.28271781e+00,  6.26487870e-01, -6.16194199e-01,  6.40194109e-01,
        5.08885183e-01,  1.56728303e-01, -1.52526474e+00,  1.45677156e+00,
        9.53599176e-01,  1.60347358e+00, -5.30334832e-01,  3.83027004e-01,
       -1.29671977e+00,  7.43395848e-01, -5.27002544e-02,  4.31821823e-01,
        4.32639852e-01, -4.87816605e-01,  1.09294258e+00, -1.24192992e-01,
        5.61649289e-01,  9.78906836e-02,  1.89566239e+00, -6.10474723e-01,
        1.06973417e+00, -1.30614154e+00,  4.24612122e-01,  1.60214298e+00,
        3.69632147e-01,  8.36293597e-01,  1.85074767e+00, -7.90542758e-01,
        8.99060428e-01,  1.18021922e+00, -3.56783678e-01,  7.76896955e-01,
       -1.17875135e+00,  1.58667953e+00, -4.47299257e-01, -8.09801684e-01,
       -5.07498680e-01,  3.99357338e-01,  9.06377677e-01,  1.69077372e+00,
       -1.11289054e+00, -1.00822281e+00, -8.81891244e-01, -9.16626843e-01,
        1.01182253e+00, -3.99059966e-01, -1.88598504e-01, -3.82249612e-01,
        1.99503287e-01,  6.74293798e-01, -8.25556641e-01, -4.50649065e-01,
       -7.66593417e-01, -4.95484390e-01,  8.35701026e-02, -1.09096663e+00,
        4.13887642e-01,  7.92641404e-02,  2.72128234e+00,  2.39040127e-01,
       -4.66380391e-01,  2.51023439e-01, -9.49738113e-01, -5.51129692e-01,
       -6.19692126e-01,  8.01554984e-01, -1.36338326e+00, -9.93364687e-01,
        1.48617022e+00,  3.78238430e-01, -7.40681680e-01, -1.05153733e+00,
        6.61384410e-01, -2.33777305e-01,  1.03928605e+00, -1.76424374e-01,
       -6.56405434e-01,  4.08168390e-01, -1.23066790e-01, -1.12553771e+00,
        3.97575928e-02,  4.26089018e-01,  4.14950357e-01,  1.36093341e+00,
       -5.30934176e-02,  6.62379213e-03, -3.85292212e-01, -3.74113687e-01,
       -5.28938439e-01, -9.95835269e-01,  6.28217928e-01,  1.45964585e+00,
        1.84203257e+00, -4.70617060e-01,  6.14662601e-01,  9.09815497e-01,
       -4.47303760e-01,  9.45976184e-01, -1.09060742e+00, -1.59796109e+00,
        1.00205771e-01,  1.77506534e-01,  2.11000815e+00, -3.39749478e-01,
        2.93936946e-01,  7.95028145e-01,  1.74204726e+00, -6.95459814e-01,
       -2.40523154e-01, -7.78309610e-01, -7.18973089e-01, -3.84259577e-01,
       -1.86576544e-02, -4.55273618e-01, -1.28116698e+00,  7.19695399e-04,
        2.83363345e-01, -2.19883906e+00,  6.34727403e-01, -1.94827266e+00,
        1.41961358e+00, -1.20793847e+00,  2.18836169e-01,  7.37797996e-01,
       -7.82189423e-01,  9.90358834e-01, -2.66306080e+00,  1.19743912e-01,
        2.71673075e-01, -1.03592415e+00,  1.28121931e+00,  1.63822378e-01,
       -2.83767878e-01, -6.12511738e-01, -2.82983165e-01,  4.27292504e-01,
        2.45386827e-01, -6.88755819e-01, -9.70329249e-01,  9.69221730e-01,
        1.82790598e+00, -1.39184840e+00, -8.81379574e-01,  1.08916919e+00,
        6.57281742e-02,  2.67013794e+00, -6.52362573e-02,  3.52076315e-01,
        7.36548879e-01,  3.82895432e-01,  1.33347352e+00,  2.49118033e-01,
        9.77580922e-01,  1.90812512e+00, -9.27248689e-01,  7.27835338e-01,
       -7.19756299e-01, -1.12246670e+00,  2.29297115e-01,  1.68047002e-01,
       -9.43655384e-01,  2.05880711e-01,  9.60728521e-01, -7.66035106e-01,
       -1.78022658e-01, -1.69155887e+00,  3.97994724e-01,  2.27143768e+00,
       -2.04463405e-01,  1.03840230e+00,  2.57855014e+00,  2.74532086e-01,
       -7.19814761e-02, -9.15473734e-01, -5.90598977e-01, -4.33733485e-01,
        6.42087484e-01,  1.06757122e+00,  5.93211838e-01,  5.29376697e-01,
        1.73329643e+00, -3.58563140e-01, -2.64582078e-01,  3.77180020e-01,
        1.20092999e+00,  3.41818551e-01,  3.40653304e-01,  1.61146278e+00,
        1.80003907e-01,  3.46561692e-01, -3.07420423e-01,  3.94600563e-01,
        4.50137863e-01,  1.39359914e+00, -1.89120457e-01, -3.52955898e-02,
       -1.14183985e+00, -4.11102450e-01, -1.93765007e-01,  7.20684952e-01,
        1.06936738e+00,  1.00038346e+00,  5.39724135e-01,  4.19126802e-01,
       -1.05548346e+00,  1.72586446e+00,  9.12550491e-01, -1.35899702e+00,
        4.19930325e-01,  9.11921255e-01, -7.37978201e-03, -1.91958988e-01,
       -1.87750066e-01,  1.03450795e+00, -8.25020283e-01,  1.10785073e-01,
        2.89488851e-01, -1.17101819e+00,  1.26080203e+00,  2.54817567e-01,
       -2.83861762e-01,  1.37697242e+00,  1.34680831e+00, -1.12724590e+00,
       -4.61179682e-01, -5.43120970e-01, -3.54906172e-02,  1.50128638e+00,
        7.94771104e-01, -9.88592104e-01, -1.14082161e-02,  2.54174069e-01,
       -8.43629235e-01,  4.42725009e-01, -2.14513749e-01,  6.54049360e-01,
        2.19000461e+00, -2.20909728e-01,  3.43541035e-01,  7.06709058e-01,
       -4.78728263e-02, -2.06400523e+00,  5.04441876e-01, -1.17798485e+00,
        1.11532950e+00, -8.60251720e-01, -1.02577727e+00,  7.40495064e-01,
        6.53376138e-01,  1.09519747e+00,  1.82084196e+00, -1.69110803e-01,
       -8.21954095e-01,  7.51346218e-01,  7.08096024e-01,  1.28161173e-01,
        5.66500307e-01, -8.16748750e-02, -1.41946087e+00, -8.82979071e-02,
        1.42859508e-01, -7.94653830e-01,  3.17242842e-01, -1.05793704e+00,
       -1.74576217e+00,  5.85054225e-01,  8.99965326e-01, -6.22386037e-01,
        8.76259332e-01,  3.51914669e-01, -1.06148785e-01, -2.31611555e-01,
        1.41358469e+00,  2.22432467e-01,  7.30210856e-01, -2.33676577e+00,
        2.63921291e-01,  3.44652765e-01,  8.41700528e-01,  3.91510805e-01,
        1.60520787e+00,  3.56229091e-02,  3.00826188e-02,  1.18386820e+00,
        4.53738306e-01,  3.21789634e-01,  1.45652995e+00, -6.29819053e-01,
       -1.80972243e+00,  9.64463881e-02,  9.50073150e-01, -5.56112782e-01,
        9.27580708e-01,  1.26056454e+00,  8.40487366e-01, -1.46845948e+00,
        2.82209255e-01, -2.34327664e+00,  9.12415968e-01, -9.22132358e-01,
        8.88381991e-01,  6.02580931e-01,  1.56794655e+00,  1.62441442e+00,
        6.66447066e-01,  1.09590559e+00, -1.09947780e+00, -8.42365737e-01,
        3.37867167e-01, -5.22475933e-01, -1.58929951e+00,  1.57731938e+00,
       -2.88242905e-01,  2.50104579e-01, -1.84864102e-01, -8.76707315e-01,
       -2.43906841e-01,  4.03419668e-01,  7.39776554e-01, -1.34331578e-02,
       -9.43828812e-01, -7.69747860e-01,  1.16848921e+00, -4.92870888e-01,
       -2.45281386e-02,  1.47784274e+00,  4.05044238e-01,  5.44142534e-01,
        2.45965430e-01,  6.19394665e-01, -9.15349012e-01, -2.12010312e+00,
        1.64332641e-01, -7.34847684e-01,  2.97597754e-01,  1.04195050e+00,
       -1.03480951e-01,  1.76229054e+00, -5.59527099e-01,  1.32316594e+00,
       -3.03000999e-01,  9.28770246e-01, -1.60943550e+00,  3.10567941e-01,
       -9.11550811e-01,  7.31810755e-01, -6.77590410e-01, -4.63796624e-01,
       -3.27387059e-01,  1.55652012e+00,  1.57091328e+00,  5.48335737e-01,
       -1.16842616e+00,  2.21316238e+00,  7.40782326e-01,  8.83000461e-01,
       -1.19030310e+00,  6.40435835e-01, -1.11583730e+00, -3.04050380e-02,
       -2.24467818e-01, -8.41252204e-01,  3.35272024e-01,  1.64912925e-01,
        1.52260140e-01, -4.20772884e-01,  1.87070467e-01, -8.02627325e-01,
        8.47479756e-01, -8.70030620e-01, -5.70504039e-01,  2.84032828e-01,
        1.06592248e+00, -1.51856624e+00,  2.83183476e-01, -8.24509967e-01,
        7.58318867e-02, -1.05293124e+00,  4.69538155e-01,  1.16516244e+00,
        1.50909417e+00,  2.17285620e+00, -3.48218751e-01,  7.30776360e-01,
        5.70546325e-01,  5.19025137e-01,  1.24818393e+00,  6.52063804e-01,
        1.83363638e+00, -1.31909852e+00, -7.39036280e-01, -6.44120007e-01,
        1.45012703e+00, -7.89723385e-02,  6.96828755e-01, -1.39788328e+00,
        1.17244091e+00, -1.41086472e+00, -3.77250789e-01,  1.23325118e+00,
       -1.27649163e+00, -5.69026359e-01, -1.16344083e+00, -4.14919094e-01,
       -7.36933052e-01, -1.62283755e+00,  1.03331795e+00,  2.23862413e-01,
       -6.10982262e-01, -8.32102343e-01,  1.75559332e+00,  4.67549292e-01,
       -1.08435519e-02,  5.97631180e-01, -6.34440206e-01, -3.78531853e-01,
        8.89369101e-01, -4.58710889e-01, -5.09629695e-01,  9.11736399e-02,
        5.70940493e-01,  4.69966776e-01, -5.73468498e-01,  5.87875832e-01,
       -1.19365760e+00,  1.15712038e-01,  1.77087539e+00, -1.32372695e+00,
        9.85267907e-01, -1.06466842e-02, -3.17080651e-01,  2.65628274e-01,
        7.26327293e-01,  1.43286065e-01, -2.84707168e+00,  3.41492965e-01,
        8.69480594e-01,  1.30443618e+00, -1.72082641e-01,  2.48055247e-01,
        7.35887327e-01,  6.80599211e-01, -9.28110119e-01, -6.54630970e-01,
        5.07522961e-01, -4.33939092e-01, -6.37849061e-01,  9.70715607e-01,
        5.28789915e-01, -5.49165426e-01,  5.85909892e-01, -1.25574171e+00,
       -2.16451477e-01, -2.87863791e-01, -1.08284602e+00,  8.46520171e-01,
       -4.44580894e-01,  4.24675737e-01,  2.26108435e-01, -1.15683441e+00,
       -2.53005465e-01, -1.02337848e+00,  2.05489314e+00,  2.56712995e-01,
        1.48680245e+00,  7.73060819e-01, -1.74355451e+00, -2.51400314e-01,
       -1.35708322e-01,  7.78858668e-01, -1.04447928e+00, -1.65963137e+00,
        6.22804906e-01, -1.32902414e+00,  1.30627215e+00,  5.12594886e-01,
        1.68926343e+00, -2.23250982e-01,  1.25631781e+00, -5.16297753e-01,
        2.45609609e-01,  7.75028896e-01, -1.33407150e+00, -5.26135946e-01,
        1.05535184e+00, -1.39054526e+00,  8.44081223e-01,  1.73765927e+00,
       -8.43409418e-01, -2.29010003e-01, -3.52198743e-01,  4.60170004e-01,
       -3.64875610e-01, -1.77360267e-01, -7.76461434e-01,  1.48001740e+00,
       -1.57744610e+00,  2.17080090e+00, -8.24200963e-01,  1.19279131e+00,
       -5.88789961e-01,  1.34346148e+00, -8.22366930e-01, -9.20300580e-01,
       -3.89402796e-01,  9.40069038e-01, -1.61074213e+00, -1.29097723e+00,
       -1.74685731e-01, -2.93285105e-01, -4.75197192e-01,  9.08220844e-02,
       -9.52849230e-01, -3.68221863e-01,  9.43438926e-01, -4.23006909e-01,
       -1.16036394e+00,  1.05694965e+00,  2.01912712e+00,  1.05207267e+00,
        3.90757690e-01,  1.42904479e+00,  4.21271217e-01,  9.19336819e-02,
       -2.07734098e-01,  1.08098104e+00,  8.21702055e-01, -1.86423743e-01,
       -3.60151148e-01, -1.09556440e+00, -2.77036205e-01,  2.08722056e-01,
       -1.10172445e+00, -1.34597377e+00,  3.28073776e-01, -4.37789919e-01,
       -3.33645729e-01,  6.02273859e-02,  1.04510338e+00, -2.43488614e-01,
        1.42726509e+00, -4.57126736e-01,  9.74182240e-01,  2.25939907e-01,
       -1.61944141e+00, -1.59875202e+00, -5.11118632e-01,  3.77960896e-01,
       -2.72704081e-02,  4.29401458e-02,  2.20999973e+00, -2.13757461e-01,
        9.53521013e-01,  1.33557648e-01,  3.71161705e-01, -1.85385112e-01,
       -2.27414230e-01, -1.05204112e+00, -4.38895403e-02,  3.03450725e-02,
        7.56224441e-01,  1.56730941e+00, -3.03183871e-01, -1.09905127e+00,
        9.85405996e-01, -8.06170461e-01, -3.97585739e-01, -1.43028597e+00,
        5.32761270e-01,  9.86889159e-01, -8.26441282e-01,  1.29267143e-01,
        9.73008941e-01, -5.84076214e-02,  2.69822594e+00,  1.25576181e+00])

In [47]:
quartiles = pd.qcut(data, 4, precision=2)               #quarter cut 4개 범주로 나눈다.
quartiles
pd.value_counts(quartiles)

(-3.17, -0.61]    250
(-0.61, 0.082]    250
(0.082, 0.72]     250
(0.72, 2.84]      250
dtype: int64

In [48]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-3.1639999999999997, -1.129]    100
(-1.129, 0.082]                  400
(0.082, 1.284]                   400
(1.284, 2.836]                   100
dtype: int64

In [49]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.018943    -0.029426    -0.036563    -0.006634
std       0.968079     0.980054     1.005536     0.970159
min      -3.259784    -3.108208    -3.124487    -3.248197
25%      -0.653766    -0.672407    -0.732675    -0.618099
50%       0.030705    -0.049300    -0.037105    -0.020129
75%       0.671830     0.653957     0.683988     0.626911
max       3.371516     2.864219     2.821838     3.501122

In [50]:
col = data[2]                         #3번째 컬럼에서 절대값 3이 넘는 값과 인덱스 출력
col[col.abs() > 3]

45    -3.045460
246   -3.124487
527   -3.044446
Name: 2, dtype: float64

In [51]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
8    3.371516 -1.499469 -1.088591  0.321886
45   0.320780  0.869931 -3.045460  0.043313
246  0.837017 -1.272104 -3.124487 -0.429475
274 -3.259784  0.266025 -2.077967 -1.510862
350 -1.006112  1.196316 -0.539068  3.501122
527 -1.660540 -0.545524 -3.044446  0.054046
883 -2.352070  2.539077  0.849932 -3.248197
905 -2.205616 -3.108208  0.545110  0.554660
938 -0.210903 -0.344303  1.226982  3.316124
996 -0.619131 -0.285780 -0.300210 -3.066618

In [52]:
data[(data.abs() > 3).any(axis=1)]

            0         1         2         3
8    3.371516 -1.499469 -1.088591  0.321886
45   0.320780  0.869931 -3.045460  0.043313
246  0.837017 -1.272104 -3.124487 -0.429475
274 -3.259784  0.266025 -2.077967 -1.510862
350 -1.006112  1.196316 -0.539068  3.501122
527 -1.660540 -0.545524 -3.044446  0.054046
883 -2.352070  2.539077  0.849932 -3.248197
905 -2.205616 -3.108208  0.545110  0.554660
938 -0.210903 -0.344303  1.226982  3.316124
996 -0.619131 -0.285780 -0.300210 -3.066618

In [53]:
data[(data.abs()>3)].count()

0    2
1    1
2    3
3    4
dtype: int64

In [54]:
np.sign(data) #np.sign 양수이면 1 음수면 -1, 0이면 0으로 만들어준다.

       0    1    2    3
0   -1.0 -1.0 -1.0  1.0
1    1.0 -1.0 -1.0 -1.0
2    1.0 -1.0  1.0  1.0
3   -1.0  1.0  1.0  1.0
4   -1.0 -1.0  1.0  1.0
..   ...  ...  ...  ...
995  1.0  1.0  1.0 -1.0
996 -1.0 -1.0 -1.0 -1.0
997  1.0  1.0 -1.0  1.0
998 -1.0  1.0  1.0  1.0
999  1.0 -1.0 -1.0 -1.0

[1000 rows x 4 columns]

In [55]:
data[data.abs() > 3] = np.sign(data) * 3 
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.018831    -0.029318    -0.036348    -0.007137
std       0.966015     0.979719     1.004893     0.966429
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.653766    -0.672407    -0.732675    -0.618099
50%       0.030705    -0.049300    -0.037105    -0.020129
75%       0.671830     0.653957     0.683988     0.626911
max       3.000000     2.864219     2.821838     3.000000

In [56]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0  1.0
1  1.0 -1.0 -1.0 -1.0
2  1.0 -1.0  1.0  1.0
3 -1.0  1.0  1.0  1.0
4 -1.0 -1.0  1.0  1.0

In [59]:
sampler = np.random.permutation(5)
sampler

array([4, 2, 1, 0, 3])

In [62]:
column_sampler = np.random.permutation(7)                    #표로 출력 컬럼은 permutation 숫자로 랜덤순서로 생김  
column_sampler
df.take(column_sampler, axis=1)

    3   1   2   6   4   0   5
0   3   1   2   6   4   0   5
1  13  11  12  16  14  10  15
2  23  21  22  26  24  20  25
3  33  31  32  36  34  30  35

In [63]:
column_sampler = np.random.permutation(10)                     
column_sampler
df.take(column_sampler, axis=1)

    1   3   6   0   5   2   8   4   7   9
0   1   3   6   0   5   2   8   4   7   9
1  11  13  16  10  15  12  18  14  17  19
2  21  23  26  20  25  22  28  24  27  29
3  31  33  36  30  35  32  38  34  37  39

In [70]:
df

    0   1   2   3   4   5   6   7   8   9
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39

In [71]:
df.sample(n=2)

    0   1   2   3   4   5   6   7   8   9
2  20  21  22  23  24  25  26  27  28  29
1  10  11  12  13  14  15  16  17  18  19

In [72]:
choices = pd.Series([5, 7, -1, 6, 4])
choices.sample(n=10, replace=True)

3    6
3    6
3    6
2   -1
1    7
4    4
0    5
4    4
3    6
1    7
dtype: int64

In [74]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [75]:
pd.get_dummies(df["key"]) #key값들이 컬럼이 되어 표 재구성

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [77]:
dummies = pd.get_dummies(df["key"], prefix="Key")           #prefix가 앞에 붙어 컬럼명이 설정됨
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  Key_a  Key_b  Key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [78]:
mnames = ["movie_id", "title", "genres"]
movies = pd.read_table("datasets/movielens/movies.dat", sep="::",
                       header=None, names=mnames, engine="python")
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [79]:
dummies = movies["genres"].str.get_dummies("|")
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [80]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [81]:
np.random.seed(12345) # 반복을 위해서 시드 설정
values = np.random.uniform(size=10)
values
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [82]:
s = pd.Series([1, 2, 3, None])
s
s.dtype

dtype('float64')

In [84]:
s[3]
s[3] is pd.NA

True

In [ ]:
s = pd.Series([1, 2, 3, None], dtype="Int64")

In [ ]:
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())
s

In [85]:
df = pd.DataFrame({"A": [1, 2, None, 4],
                   "B": ["one", "two", "three", None],
                   "C": [False, None, False, True]})
df
df["A"] = df["A"].astype("Int64") #type 변경
df["B"] = df["B"].astype("string")
df["C"] = df["C"].astype("boolean")
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

In [86]:
val = "a,b,  guido"
val.split(",")

['a', 'b', '  guido']

In [87]:
pieces = [x.strip() for x in val.split(",")]
pieces

['a', 'b', 'guido']

In [88]:
first, second, third = pieces
first + "::" + second + "::" + third

'a::b::guido'

In [89]:
"::".join(pieces)

'a::b::guido'

In [90]:
"guido" in val
val.index(",")
val.find(":")

-1

In [91]:
val.count(",")

2

In [92]:
val.replace(",", "::")
val.replace(",", "")

'ab  guido'

In [94]:
import re
text = "foo    bar\t baz  \tqux"
re.split(r"\s+", text)                  #탭 스페이스바 같은 공백 제거

['foo', 'bar', 'baz', 'qux']

In [95]:
regex = re.compile(r"\s+")
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [96]:
regex.findall(text)

['    ', '\t ', '  \t']

In [97]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# re.IGNORECASE makes the regex case insensitive
regex = re.compile(pattern, flags=re.IGNORECASE) #규칙

In [98]:
regex.findall(text) #규칙에 맞는 것 찾기

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [101]:
m = regex.search(text)
m
#text[m.start():m.end()]

<re.Match object; span=(5, 20), match='dave@google.com'>

In [ ]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
regex = re.compile(pattern, flags=re.IGNORECASE)

In [104]:
m = regex.match("wesm@bright.net")
m.groups()

()

In [105]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [ ]:
print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

In [106]:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
        "Rob": "rob@gmail.com", "Wes": np.nan}
data = pd.Series(data)
data
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [107]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [108]:
data_as_string_ext = data.astype('string')
data_as_string_ext
data_as_string_ext.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [109]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [110]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]
matches
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [111]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [112]:
data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

In [116]:
values = pd.Series(['apple', 'orange', 'apple',
                    'apple'] * 2)
print(values)
pd.unique(values)
pd.value_counts(values)

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

apple     6
orange    2
dtype: int64

In [118]:
values = pd.Series([0, 1, 0, 0] * 2)
dim = pd.Series(['apple', 'orange'])
print(values)
dim

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

0     apple
1    orange
dtype: object

In [119]:
dim.take(values) #values 값으로 dim의 값 추출하는 것

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

In [120]:
fruits = ['apple', 'orange', 'apple', 'apple'] * 2
N = len(fruits)
rng = np.random.default_rng(seed=12345)
df = pd.DataFrame({'fruit': fruits,
                   'basket_id': np.arange(N),
                   'count': rng.integers(3, 15, size=N),
                   'weight': rng.uniform(0, 4, size=N)},
                  columns=['basket_id', 'fruit', 'count', 'weight'])
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [121]:
fruit_cat = df['fruit'].astype('category')
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [122]:
c = fruit_cat.array
type(c)

pandas.core.arrays.categorical.Categorical

In [123]:
c.categories
c.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [124]:
dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [125]:
df['fruit'] = df['fruit'].astype('category')
df["fruit"]

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [126]:
my_categories = pd.Categorical(['foo', 'bar', 'baz', 'foo', 'bar'])
my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [127]:
categories = ['foo', 'bar', 'baz']
codes = [0, 1, 2, 0, 0, 1]
my_cats_2 = pd.Categorical.from_codes(codes, categories)
my_cats_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

In [128]:
ordered_cat = pd.Categorical.from_codes(codes, categories,
                                        ordered=True)
ordered_cat

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [129]:
my_cats_2.as_ordered()

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [130]:
rng = np.random.default_rng(seed=12345)
draws = rng.standard_normal(1000)
draws[:5]

array([-1.42382504,  1.26372846, -0.87066174, -0.25917323, -0.07534331])

In [131]:
bins = pd.qcut(draws, 4)
bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [132]:
bins = pd.qcut(draws, 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])
bins
bins.codes[:10]

array([0, 3, 0, 1, 1, 0, 0, 2, 2, 0], dtype=int8)

In [133]:
bins = pd.Series(bins, name='quartile')
results = (pd.Series(draws)
           .groupby(bins)
           .agg(['count', 'min', 'max'])
           .reset_index())
results

  quartile  count       min       max
0       Q1    250 -3.119609 -0.678494
1       Q2    250 -0.673305  0.008009
2       Q3    250  0.018753  0.686183
3       Q4    250  0.688282  3.211418

In [134]:
results['quartile']

0    Q1
1    Q2
2    Q3
3    Q4
Name: quartile, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [135]:
N = 10_000_000
labels = pd.Series(['foo', 'bar', 'baz', 'qux'] * (N // 4))

In [136]:
categories = labels.astype('category')

In [138]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)
cat_s = s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [139]:
cat_s.cat.codes
cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [140]:
actual_categories = ['a', 'b', 'c', 'd', 'e']
cat_s2 = cat_s.cat.set_categories(actual_categories)
cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [141]:
cat_s.value_counts()
cat_s2.value_counts()

a    2
b    2
c    2
d    2
e    0
dtype: int64

In [142]:
cat_s3 = cat_s[cat_s.isin(['a', 'b'])]
cat_s3
cat_s3.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): ['a', 'b']

In [143]:
cat_s = pd.Series(['a', 'b', 'c', 'd'] * 2, dtype='category')

In [144]:
pd.get_dummies(cat_s)

   a  b  c  d
0  1  0  0  0
1  0  1  0  0
2  0  0  1  0
3  0  0  0  1
4  1  0  0  0
5  0  1  0  0
6  0  0  1  0
7  0  0  0  1